import math


def area(r):
    '''
    Возвращает площадь круга по заданному радусу.

    Параметры:
        r (float/int): радиус круга.

    Возвращаемое значение:
        area (float): площадь круга.
        
    Пример вызова:
        print(area(3)) # Вывод: 28.274333882308138
    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Возвращает периметр круга (длина окружности) по заданному радиусу.

    Параметры:
        r (float/int): радиус круга.

    Возвращаемое значение:
        perimeter (float): длина окружности.

    Пример вызова:
        print(perimeter(3)) # Вывод: 18.84955592153876
    '''
    return 2 * math.pi * r

