def area(a, b):
    '''
    Возвращает площадь прямоугольника по двум его сторонам.

    Параметры:
            a (float/int): длина первой стороны.
            b (float/int): длина второй стороны.

    
        Возвращаемое значение:
            a * b (float/int): площадь прямоугольника.
    
        Пример вызова:
            print(area(4, 6)) # Вывод: 24
    '''
    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника по двум его сторонам.

    Параметры:
            a (float/int): длина первой стороны.
            b (float/int): длина второй стороны.

    
        Возвращаемое значение:
            2 * (a + b) (float/int): периметр прямоугольника.
    
        Пример вызова:
            print(perimeter(4, 6)) # Вывод: 20
    '''
    return 2 * (a + b)