
def area(a):
    '''
    Возвращает площадь квадрата по длине его стороны.

    Параметры:
        a (float/int): длина стороны квадрата.

    Возвращаемое значение:
        a * a (float/int): площадь квадрата.

    Пример вызова:
        print(area(5)) # Вывод: 25
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата по длине его стороны.

    Параметры:
        a (float/int): длина стороны квадрата.

    Возвращаемое значение:
        4 * a (float/int): периметр квадрата.

    Пример вызова:
        print(perimeter(5)) # Вывод: 20
    '''
    return 4 * a
