def area(a, h):
    '''
    Возвращает площадь треугольника по стороне и высоте.

    Параметры:
            a (float/int): длина основания.
            h (float/int): длина высоты.

    
        Возвращаемое значение:
            (a * h) / 2 (float/int): площадь треугольника.
    
        Пример вызова:
            print(area(3, 4)) # Вывод: 6.0
    '''
    return (a * h) / 2

def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника по трем его сторонам.

    Параметры:
            a (float/int): длина первой стороны.
            b (float/int): длина второй стороны.
            c (float/int): длина третьей стороны.

        Возвращаемое значение:
            a + b + c (float/int): периметр треугольника.
    
        Пример вызова:
            print(perimeter(3, 4, 5)) # Вывод: 12
    '''
    return 2 * (a + b)